# Stock Price Analysis and Comparison

Vincent Luong

Write brief introduction about time series analysis

In [1]:
import numpy as np
import pandas as pd
from datetime import datetime as dt
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

## Importing Datasets and Summary Statistics

### Tesla

In [2]:
tesla_dat = pd.read_csv('data/tesla.csv')
tesla_dat.head()

        Date       Open   High        Low      Close    Volume  Adj Close
0  6/29/2010  19.000000  25.00  17.540001  23.889999  18766300  23.889999
1  6/30/2010  25.790001  30.42  23.299999  23.830000  17187100  23.830000
2   7/1/2010  25.000000  25.92  20.270000  21.959999   8218800  21.959999
3   7/2/2010  23.000000  23.10  18.709999  19.200001   5139800  19.200001
4   7/6/2010  20.000000  20.00  15.830000  16.110001   6866900  16.110001

From the tesla dataset, we have 7 features (1 categorical and 6 numerical):

-`Date`: The date M/D/Y<br>
-`Open`: The opening price of stock (in USD) <br>
-`High`: The high price of that day (in USD) <br>
-`Low`: The low price of that day (in USD) <br> 
-`Close`: The closed price of that day (in USD) <br>
-`Volume`: The amount of stocks traded during that day <br>
-`Adj Close`: The stock's closing price that has been amended to include any distributions/coporate actions that occurs before next days open (in USD) <br>

In [3]:
tesla_dat.describe

<bound method NDFrame.describe of            Date        Open        High         Low       Close    Volume  \
0     6/29/2010   19.000000   25.000000   17.540001   23.889999  18766300
1     6/30/2010   25.790001   30.420000   23.299999   23.830000  17187100
2      7/1/2010   25.000000   25.920000   20.270000   21.959999   8218800
3      7/2/2010   23.000000   23.100000   18.709999   19.200001   5139800
4      7/6/2010   20.000000   20.000000   15.830000   16.110001   6866900
...         ...         ...         ...         ...         ...       ...
1687  3/13/2017  244.820007  246.850006  242.779999  246.169998   3010700
1688  3/14/2017  246.110001  258.119995  246.020004  258.000000   7575500
1689  3/15/2017  257.000000  261.000000  254.270004  255.729996   4816600
1690  3/16/2017  262.399994  265.750000  259.059998  262.049988   7100400
1691  3/17/2017  264.000000  265.329987  261.200012  261.500000   6475900

       Adj Close
0      23.889999
1      23.830000
2      21.959999
3      19.200001
4      16.110001
...          ...
1687  246.169998
1688  258.000000
1689  255.729996
1690  262.049988
1691  261.500000

[1692 rows x 7 columns]>

In [4]:
tesla_dat.shape

(1692, 7)

In [5]:
tesla_dat['Date'].min()

'1/10/2011'

In [6]:
tesla_dat['Date'].max()

'9/9/2016'

**Note**: Since the format is M/D/Y, it looks like the data ranges from the start of January 2011 to September 2016, for a total of 5.5 years.

### S&P 500

In [7]:
s500_dat = pd.read_csv('data/s500.csv')
s500_dat.head()

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

From the S&P 500 dataset, we also have 7 features.  With 5 numerical features and 2 categorical features we have the following:

-`date`: The date Y-M-D <br>
-`open`: Price of the stock at market open (in USD) <br>
-`high`: Highest price reached that day (in USD) <br>
-`low`: lowest price reached in the day (in USD) <br>
-`Volume`: Number of shares traded <br>
-`Name`: The stock's ticker name

In [8]:
s500_dat.describe

<bound method NDFrame.describe of               date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619040 rows x 7 columns]>

In [9]:
#See if this dataset includes TSLA stocks

#unique_count = s500_dat['Name'].unique()
#for name in unique_count:
#    print(name)


#Code ran and it doesn't include Stocks from TSLA

In [10]:
s500_dat.shape

(619040, 7)

In [11]:
s500_dat['date'].min()

'2013-02-08'

In [12]:
s500_dat['date'].max()

'2018-02-07'

**Note**: Since the format is Y/M/D, the data ranges from the start of Feburary 2013 to Feburary 2018, for a total of 5 years.

## Discovering Seperate Measurements

Since the Tesla dataset doesn't include any non-date categorical variables, we can ignore that and perform EDA on the S&P 500 dataset.

In [13]:
s500_dat.sort_values(by="date").head()

              date    open      high      low   close   volume Name
0       2013-02-08   15.07   15.1200   14.630   14.75  8407500  AAL
508224  2013-02-08   81.22   81.9300   80.940   81.89   296853  SLG
506965  2013-02-08   78.24   79.0700   78.125   79.07  4632684  SLB
85755   2013-02-08  236.64  238.6924  235.750  238.16   552207  BLK
505706  2013-02-08   89.04   89.4800   88.910   89.16   554948  SJM

From the above, we definitely see stock prices flucutating on the same date for different names, now lets group by names

In [14]:
s500_dat.sort_values(by=["Name", "date"]).head()

             date   open   high    low  close   volume Name
71611  2013-02-08  45.07  45.35  45.00  45.08  1824755    A
71612  2013-02-11  45.17  45.18  44.45  44.60  2915405    A
71613  2013-02-12  44.81  44.95  44.50  44.62  2373731    A
71614  2013-02-13  44.81  45.24  44.68  44.75  2052338    A
71615  2013-02-14  44.72  44.78  44.36  44.58  3826245    A

Since we see that we have a sequence of dates with a single row per date, we can see that we have seperate timeseries for each combinations of `Name`.  This make sense as s&p 500 is an index fund composed of many stocks in the stock market.

## Discovering Equally Spaced Measurements

In [15]:
# Convert the 'Date' column to datetime format
tesla_dat['Date'] = pd.to_datetime(tesla_dat['Date'], format='%m/%d/%Y')  # Adjust input format for Y/M/D for modularity

# Format the 'Date' column to Y-M-D for modularity
tesla_dat['Date'] = tesla_dat['Date'].dt.strftime('%Y-%m-%d')

tesla_dat.head()

         Date       Open   High        Low      Close    Volume  Adj Close
0  2010-06-29  19.000000  25.00  17.540001  23.889999  18766300  23.889999
1  2010-06-30  25.790001  30.42  23.299999  23.830000  17187100  23.830000
2  2010-07-01  25.000000  25.92  20.270000  21.959999   8218800  21.959999
3  2010-07-02  23.000000  23.10  18.709999  19.200001   5139800  19.200001
4  2010-07-06  20.000000  20.00  15.830000  16.110001   6866900  16.110001

handle missing values in next step